; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l6-t1-p7---int100n150-m25---int100c150---s123---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level6 level6)
(sum level0 level7 level7)
(sum level0 level8 level8)
(sum level0 level16 level16)
(sum level0 level17 level17)
(sum level0 level22 level22)
(sum level0 level24 level24)
(sum level1 level2 level3)
(sum level1 level6 level7)
(sum level1 level7 level8)
(sum level1 level8 level9)
(sum level1 level16 level17)
(sum level1 level17 level18)
(sum level1 level22 level23)
(sum level1 level24 level25)
(sum level2 level2 level4)
(sum level2 level6 level8)
(sum level2 level7 level9)
(sum level2 level8 level10)
(sum level2 level16 level18)
(sum level2 level17 level19)
(sum level2 level22 level24)
(sum level2 level24 level26)
(sum level3 level2 level5)
(sum level3 level6 level9)
(sum level3 level7 level10)
(sum level3 level8 level11)
(sum level3 level16 level19)
(sum level3 level17 level20)
(sum level3 level22 level25)
(sum level3 level24 level27)
(sum level4 level2 level6)
(sum level4 level6 level10)
(sum level4 level7 level11)
(sum level4 level8 level12)
(sum level4 level16 level20)
(sum level4 level17 level21)
(sum level4 level22 level26)
(sum level4 level24 level28)
(sum level5 level2 level7)
(sum level5 level6 level11)
(sum level5 level7 level12)
(sum level5 level8 level13)
(sum level5 level16 level21)
(sum level5 level17 level22)
(sum level5 level22 level27)
(sum level5 level24 level29)
(sum level6 level2 level8)
(sum level6 level6 level12)
(sum level6 level7 level13)
(sum level6 level8 level14)
(sum level6 level16 level22)
(sum level6 level17 level23)
(sum level6 level22 level28)
(sum level6 level24 level30)
(sum level7 level2 level9)
(sum level7 level6 level13)
(sum level7 level7 level14)
(sum level7 level8 level15)
(sum level7 level16 level23)
(sum level7 level17 level24)
(sum level7 level22 level29)
(sum level7 level24 level31)
(sum level8 level2 level10)
(sum level8 level6 level14)
(sum level8 level7 level15)
(sum level8 level8 level16)
(sum level8 level16 level24)
(sum level8 level17 level25)
(sum level8 level22 level30)
(sum level8 level24 level32)
(sum level9 level2 level11)
(sum level9 level6 level15)
(sum level9 level7 level16)
(sum level9 level8 level17)
(sum level9 level16 level25)
(sum level9 level17 level26)
(sum level9 level22 level31)
(sum level9 level24 level33)
(sum level10 level2 level12)
(sum level10 level6 level16)
(sum level10 level7 level17)
(sum level10 level8 level18)
(sum level10 level16 level26)
(sum level10 level17 level27)
(sum level10 level22 level32)
(sum level10 level24 level34)
(sum level11 level2 level13)
(sum level11 level6 level17)
(sum level11 level7 level18)
(sum level11 level8 level19)
(sum level11 level16 level27)
(sum level11 level17 level28)
(sum level11 level22 level33)
(sum level11 level24 level35)
(sum level12 level2 level14)
(sum level12 level6 level18)
(sum level12 level7 level19)
(sum level12 level8 level20)
(sum level12 level16 level28)
(sum level12 level17 level29)
(sum level12 level22 level34)
(sum level12 level24 level36)
(sum level13 level2 level15)
(sum level13 level6 level19)
(sum level13 level7 level20)
(sum level13 level8 level21)
(sum level13 level16 level29)
(sum level13 level17 level30)
(sum level13 level22 level35)
(sum level13 level24 level37)
(sum level14 level2 level16)
(sum level14 level6 level20)
(sum level14 level7 level21)
(sum level14 level8 level22)
(sum level14 level16 level30)
(sum level14 level17 level31)
(sum level14 level22 level36)
(sum level14 level24 level38)
(sum level15 level2 level17)
(sum level15 level6 level21)
(sum level15 level7 level22)
(sum level15 level8 level23)
(sum level15 level16 level31)
(sum level15 level17 level32)
(sum level15 level22 level37)
(sum level15 level24 level39)
(sum level16 level2 level18)
(sum level16 level6 level22)
(sum level16 level7 level23)
(sum level16 level8 level24)
(sum level16 level16 level32)
(sum level16 level17 level33)
(sum level16 level22 level38)
(sum level16 level24 level40)
(sum level17 level2 level19)
(sum level17 level6 level23)
(sum level17 level7 level24)
(sum level17 level8 level25)
(sum level17 level16 level33)
(sum level17 level17 level34)
(sum level17 level22 level39)
(sum level17 level24 level41)
(sum level18 level2 level20)
(sum level18 level6 level24)
(sum level18 level7 level25)
(sum level18 level8 level26)
(sum level18 level16 level34)
(sum level18 level17 level35)
(sum level18 level22 level40)
(sum level18 level24 level42)
(sum level19 level2 level21)
(sum level19 level6 level25)
(sum level19 level7 level26)
(sum level19 level8 level27)
(sum level19 level16 level35)
(sum level19 level17 level36)
(sum level19 level22 level41)
(sum level19 level24 level43)
(sum level20 level2 level22)
(sum level20 level6 level26)
(sum level20 level7 level27)
(sum level20 level8 level28)
(sum level20 level16 level36)
(sum level20 level17 level37)
(sum level20 level22 level42)
(sum level20 level24 level44)
(sum level21 level2 level23)
(sum level21 level6 level27)
(sum level21 level7 level28)
(sum level21 level8 level29)
(sum level21 level16 level37)
(sum level21 level17 level38)
(sum level21 level22 level43)
(sum level21 level24 level45)
(sum level22 level2 level24)
(sum level22 level6 level28)
(sum level22 level7 level29)
(sum level22 level8 level30)
(sum level22 level16 level38)
(sum level22 level17 level39)
(sum level22 level22 level44)
(sum level22 level24 level46)
(sum level23 level2 level25)
(sum level23 level6 level29)
(sum level23 level7 level30)
(sum level23 level8 level31)
(sum level23 level16 level39)
(sum level23 level17 level40)
(sum level23 level22 level45)
(sum level23 level24 level47)
(sum level24 level2 level26)
(sum level24 level6 level30)
(sum level24 level7 level31)
(sum level24 level8 level32)
(sum level24 level16 level40)
(sum level24 level17 level41)
(sum level24 level22 level46)
(sum level24 level24 level48)
(sum level25 level2 level27)
(sum level25 level6 level31)
(sum level25 level7 level32)
(sum level25 level8 level33)
(sum level25 level16 level41)
(sum level25 level17 level42)
(sum level25 level22 level47)
(sum level25 level24 level49)
(sum level26 level2 level28)
(sum level26 level6 level32)
(sum level26 level7 level33)
(sum level26 level8 level34)
(sum level26 level16 level42)
(sum level26 level17 level43)
(sum level26 level22 level48)
(sum level26 level24 level50)
(sum level27 level2 level29)
(sum level27 level6 level33)
(sum level27 level7 level34)
(sum level27 level8 level35)
(sum level27 level16 level43)
(sum level27 level17 level44)
(sum level27 level22 level49)
(sum level27 level24 level51)
(sum level28 level2 level30)
(sum level28 level6 level34)
(sum level28 level7 level35)
(sum level28 level8 level36)
(sum level28 level16 level44)
(sum level28 level17 level45)
(sum level28 level22 level50)
(sum level28 level24 level52)
(sum level29 level2 level31)
(sum level29 level6 level35)
(sum level29 level7 level36)
(sum level29 level8 level37)
(sum level29 level16 level45)
(sum level29 level17 level46)
(sum level29 level22 level51)
(sum level29 level24 level53)
(sum level30 level2 level32)
(sum level30 level6 level36)
(sum level30 level7 level37)
(sum level30 level8 level38)
(sum level30 level16 level46)
(sum level30 level17 level47)
(sum level30 level22 level52)
(sum level30 level24 level54)
(sum level31 level2 level33)
(sum level31 level6 level37)
(sum level31 level7 level38)
(sum level31 level8 level39)
(sum level31 level16 level47)
(sum level31 level17 level48)
(sum level31 level22 level53)
(sum level31 level24 level55)
(sum level32 level2 level34)
(sum level32 level6 level38)
(sum level32 level7 level39)
(sum level32 level8 level40)
(sum level32 level16 level48)
(sum level32 level17 level49)
(sum level32 level22 level54)
(sum level32 level24 level56)
(sum level33 level2 level35)
(sum level33 level6 level39)
(sum level33 level7 level40)
(sum level33 level8 level41)
(sum level33 level16 level49)
(sum level33 level17 level50)
(sum level33 level22 level55)
(sum level33 level24 level57)
(sum level34 level2 level36)
(sum level34 level6 level40)
(sum level34 level7 level41)
(sum level34 level8 level42)
(sum level34 level16 level50)
(sum level34 level17 level51)
(sum level34 level22 level56)
(sum level34 level24 level58)
(sum level35 level2 level37)
(sum level35 level6 level41)
(sum level35 level7 level42)
(sum level35 level8 level43)
(sum level35 level16 level51)
(sum level35 level17 level52)
(sum level35 level22 level57)
(sum level35 level24 level59)
(sum level36 level2 level38)
(sum level36 level6 level42)
(sum level36 level7 level43)
(sum level36 level8 level44)
(sum level36 level16 level52)
(sum level36 level17 level53)
(sum level36 level22 level58)
(sum level36 level24 level60)
(sum level37 level2 level39)
(sum level37 level6 level43)
(sum level37 level7 level44)
(sum level37 level8 level45)
(sum level37 level16 level53)
(sum level37 level17 level54)
(sum level37 level22 level59)
(sum level37 level24 level61)
(sum level38 level2 level40)
(sum level38 level6 level44)
(sum level38 level7 level45)
(sum level38 level8 level46)
(sum level38 level16 level54)
(sum level38 level17 level55)
(sum level38 level22 level60)
(sum level38 level24 level62)
(sum level39 level2 level41)
(sum level39 level6 level45)
(sum level39 level7 level46)
(sum level39 level8 level47)
(sum level39 level16 level55)
(sum level39 level17 level56)
(sum level39 level22 level61)
(sum level39 level24 level63)
(sum level40 level2 level42)
(sum level40 level6 level46)
(sum level40 level7 level47)
(sum level40 level8 level48)
(sum level40 level16 level56)
(sum level40 level17 level57)
(sum level40 level22 level62)
(sum level40 level24 level64)
(sum level41 level2 level43)
(sum level41 level6 level47)
(sum level41 level7 level48)
(sum level41 level8 level49)
(sum level41 level16 level57)
(sum level41 level17 level58)
(sum level41 level22 level63)
(sum level41 level24 level65)
(sum level42 level2 level44)
(sum level42 level6 level48)
(sum level42 level7 level49)
(sum level42 level8 level50)
(sum level42 level16 level58)
(sum level42 level17 level59)
(sum level42 level22 level64)
(sum level42 level24 level66)
(sum level43 level2 level45)
(sum level43 level6 level49)
(sum level43 level7 level50)
(sum level43 level8 level51)
(sum level43 level16 level59)
(sum level43 level17 level60)
(sum level43 level22 level65)
(sum level43 level24 level67)
(sum level44 level2 level46)
(sum level44 level6 level50)
(sum level44 level7 level51)
(sum level44 level8 level52)
(sum level44 level16 level60)
(sum level44 level17 level61)
(sum level44 level22 level66)
(sum level44 level24 level68)
(sum level45 level2 level47)
(sum level45 level6 level51)
(sum level45 level7 level52)
(sum level45 level8 level53)
(sum level45 level16 level61)
(sum level45 level17 level62)
(sum level45 level22 level67)
(sum level45 level24 level69)
(sum level46 level2 level48)
(sum level46 level6 level52)
(sum level46 level7 level53)
(sum level46 level8 level54)
(sum level46 level16 level62)
(sum level46 level17 level63)
(sum level46 level22 level68)
(sum level46 level24 level70)
(sum level47 level2 level49)
(sum level47 level6 level53)
(sum level47 level7 level54)
(sum level47 level8 level55)
(sum level47 level16 level63)
(sum level47 level17 level64)
(sum level47 level22 level69)
(sum level47 level24 level71)
(sum level48 level2 level50)
(sum level48 level6 level54)
(sum level48 level7 level55)
(sum level48 level8 level56)
(sum level48 level16 level64)
(sum level48 level17 level65)
(sum level48 level22 level70)
(sum level48 level24 level72)
(sum level49 level2 level51)
(sum level49 level6 level55)
(sum level49 level7 level56)
(sum level49 level8 level57)
(sum level49 level16 level65)
(sum level49 level17 level66)
(sum level49 level22 level71)
(sum level49 level24 level73)
(sum level50 level2 level52)
(sum level50 level6 level56)
(sum level50 level7 level57)
(sum level50 level8 level58)
(sum level50 level16 level66)
(sum level50 level17 level67)
(sum level50 level22 level72)
(sum level50 level24 level74)
(sum level51 level2 level53)
(sum level51 level6 level57)
(sum level51 level7 level58)
(sum level51 level8 level59)
(sum level51 level16 level67)
(sum level51 level17 level68)
(sum level51 level22 level73)
(sum level51 level24 level75)
(sum level52 level2 level54)
(sum level52 level6 level58)
(sum level52 level7 level59)
(sum level52 level8 level60)
(sum level52 level16 level68)
(sum level52 level17 level69)
(sum level52 level22 level74)
(sum level52 level24 level76)
(sum level53 level2 level55)
(sum level53 level6 level59)
(sum level53 level7 level60)
(sum level53 level8 level61)
(sum level53 level16 level69)
(sum level53 level17 level70)
(sum level53 level22 level75)
(sum level53 level24 level77)
(sum level54 level2 level56)
(sum level54 level6 level60)
(sum level54 level7 level61)
(sum level54 level8 level62)
(sum level54 level16 level70)
(sum level54 level17 level71)
(sum level54 level22 level76)
(sum level54 level24 level78)
(sum level55 level2 level57)
(sum level55 level6 level61)
(sum level55 level7 level62)
(sum level55 level8 level63)
(sum level55 level16 level71)
(sum level55 level17 level72)
(sum level55 level22 level77)
(sum level55 level24 level79)
(sum level56 level2 level58)
(sum level56 level6 level62)
(sum level56 level7 level63)
(sum level56 level8 level64)
(sum level56 level16 level72)
(sum level56 level17 level73)
(sum level56 level22 level78)
(sum level56 level24 level80)
(sum level57 level2 level59)
(sum level57 level6 level63)
(sum level57 level7 level64)
(sum level57 level8 level65)
(sum level57 level16 level73)
(sum level57 level17 level74)
(sum level57 level22 level79)
(sum level57 level24 level81)
(sum level58 level2 level60)
(sum level58 level6 level64)
(sum level58 level7 level65)
(sum level58 level8 level66)
(sum level58 level16 level74)
(sum level58 level17 level75)
(sum level58 level22 level80)
(sum level58 level24 level82)
(sum level59 level2 level61)
(sum level59 level6 level65)
(sum level59 level7 level66)
(sum level59 level8 level67)
(sum level59 level16 level75)
(sum level59 level17 level76)
(sum level59 level22 level81)
(sum level59 level24 level83)
(sum level60 level2 level62)
(sum level60 level6 level66)
(sum level60 level7 level67)
(sum level60 level8 level68)
(sum level60 level16 level76)
(sum level60 level17 level77)
(sum level60 level22 level82)
(sum level60 level24 level84)
(sum level61 level2 level63)
(sum level61 level6 level67)
(sum level61 level7 level68)
(sum level61 level8 level69)
(sum level61 level16 level77)
(sum level61 level17 level78)
(sum level61 level22 level83)
(sum level61 level24 level85)
(sum level62 level2 level64)
(sum level62 level6 level68)
(sum level62 level7 level69)
(sum level62 level8 level70)
(sum level62 level16 level78)
(sum level62 level17 level79)
(sum level62 level22 level84)
(sum level62 level24 level86)
(sum level63 level2 level65)
(sum level63 level6 level69)
(sum level63 level7 level70)
(sum level63 level8 level71)
(sum level63 level16 level79)
(sum level63 level17 level80)
(sum level63 level22 level85)
(sum level63 level24 level87)
(sum level64 level2 level66)
(sum level64 level6 level70)
(sum level64 level7 level71)
(sum level64 level8 level72)
(sum level64 level16 level80)
(sum level64 level17 level81)
(sum level64 level22 level86)
(sum level64 level24 level88)
(sum level65 level2 level67)
(sum level65 level6 level71)
(sum level65 level7 level72)
(sum level65 level8 level73)
(sum level65 level16 level81)
(sum level65 level17 level82)
(sum level65 level22 level87)
(sum level65 level24 level89)
(sum level66 level2 level68)
(sum level66 level6 level72)
(sum level66 level7 level73)
(sum level66 level8 level74)
(sum level66 level16 level82)
(sum level66 level17 level83)
(sum level66 level22 level88)
(sum level66 level24 level90)
(sum level67 level2 level69)
(sum level67 level6 level73)
(sum level67 level7 level74)
(sum level67 level8 level75)
(sum level67 level16 level83)
(sum level67 level17 level84)
(sum level67 level22 level89)
(sum level67 level24 level91)
(sum level68 level2 level70)
(sum level68 level6 level74)
(sum level68 level7 level75)
(sum level68 level8 level76)
(sum level68 level16 level84)
(sum level68 level17 level85)
(sum level68 level22 level90)
(sum level68 level24 level92)
(sum level69 level2 level71)
(sum level69 level6 level75)
(sum level69 level7 level76)
(sum level69 level8 level77)
(sum level69 level16 level85)
(sum level69 level17 level86)
(sum level69 level22 level91)
(sum level69 level24 level93)
(sum level70 level2 level72)
(sum level70 level6 level76)
(sum level70 level7 level77)
(sum level70 level8 level78)
(sum level70 level16 level86)
(sum level70 level17 level87)
(sum level70 level22 level92)
(sum level70 level24 level94)
(sum level71 level2 level73)
(sum level71 level6 level77)
(sum level71 level7 level78)
(sum level71 level8 level79)
(sum level71 level16 level87)
(sum level71 level17 level88)
(sum level71 level22 level93)
(sum level72 level2 level74)
(sum level72 level6 level78)
(sum level72 level7 level79)
(sum level72 level8 level80)
(sum level72 level16 level88)
(sum level72 level17 level89)
(sum level72 level22 level94)
(sum level73 level2 level75)
(sum level73 level6 level79)
(sum level73 level7 level80)
(sum level73 level8 level81)
(sum level73 level16 level89)
(sum level73 level17 level90)
(sum level74 level2 level76)
(sum level74 level6 level80)
(sum level74 level7 level81)
(sum level74 level8 level82)
(sum level74 level16 level90)
(sum level74 level17 level91)
(sum level75 level2 level77)
(sum level75 level6 level81)
(sum level75 level7 level82)
(sum level75 level8 level83)
(sum level75 level16 level91)
(sum level75 level17 level92)
(sum level76 level2 level78)
(sum level76 level6 level82)
(sum level76 level7 level83)
(sum level76 level8 level84)
(sum level76 level16 level92)
(sum level76 level17 level93)
(sum level77 level2 level79)
(sum level77 level6 level83)
(sum level77 level7 level84)
(sum level77 level8 level85)
(sum level77 level16 level93)
(sum level77 level17 level94)
(sum level78 level2 level80)
(sum level78 level6 level84)
(sum level78 level7 level85)
(sum level78 level8 level86)
(sum level78 level16 level94)
(sum level79 level2 level81)
(sum level79 level6 level85)
(sum level79 level7 level86)
(sum level79 level8 level87)
(sum level80 level2 level82)
(sum level80 level6 level86)
(sum level80 level7 level87)
(sum level80 level8 level88)
(sum level81 level2 level83)
(sum level81 level6 level87)
(sum level81 level7 level88)
(sum level81 level8 level89)
(sum level82 level2 level84)
(sum level82 level6 level88)
(sum level82 level7 level89)
(sum level82 level8 level90)
(sum level83 level2 level85)
(sum level83 level6 level89)
(sum level83 level7 level90)
(sum level83 level8 level91)
(sum level84 level2 level86)
(sum level84 level6 level90)
(sum level84 level7 level91)
(sum level84 level8 level92)
(sum level85 level2 level87)
(sum level85 level6 level91)
(sum level85 level7 level92)
(sum level85 level8 level93)
(sum level86 level2 level88)
(sum level86 level6 level92)
(sum level86 level7 level93)
(sum level86 level8 level94)
(sum level87 level2 level89)
(sum level87 level6 level93)
(sum level87 level7 level94)
(sum level88 level2 level90)
(sum level88 level6 level94)
(sum level89 level2 level91)
(sum level90 level2 level92)
(sum level91 level2 level93)
(sum level92 level2 level94)

(connected l0 l1)
(fuelcost level2 l0 l1)
(connected l0 l3)
(fuelcost level8 l0 l3)
(connected l1 l0)
(fuelcost level2 l1 l0)
(connected l1 l3)
(fuelcost level22 l1 l3)
(connected l1 l4)
(fuelcost level7 l1 l4)
(connected l1 l5)
(fuelcost level17 l1 l5)
(connected l2 l3)
(fuelcost level16 l2 l3)
(connected l2 l5)
(fuelcost level24 l2 l5)
(connected l3 l0)
(fuelcost level8 l3 l0)
(connected l3 l1)
(fuelcost level22 l3 l1)
(connected l3 l2)
(fuelcost level16 l3 l2)
(connected l3 l5)
(fuelcost level2 l3 l5)
(connected l4 l1)
(fuelcost level7 l4 l1)
(connected l4 l5)
(fuelcost level6 l4 l5)
(connected l5 l1)
(fuelcost level17 l5 l1)
(connected l5 l2)
(fuelcost level24 l5 l2)
(connected l5 l3)
(fuelcost level2 l5 l3)
(connected l5 l4)
(fuelcost level6 l5 l4)

(at t0 l4)
(fuel t0 level94)
(= (total-cost) 0)

(at p0 l2)
(at p1 l5)
(at p2 l1)
(at p3 l2)
(at p4 l5)
(at p5 l5)
(at p6 l3)
)

(:goal
(and
(at p0 l0)
(at p1 l2)
(at p2 l5)
(at p3 l1)
(at p4 l4)
(at p5 l0)
(at p6 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l4 l5 level88 level6 level94)
   deleted: (at t0 l4) (fuel t0 level94)
   added: (at t0 l5) (fuel t0 level88)
   goals met: 0 of 7
2. (load p5 t0 l5)
   deleted: (at p5 l5)
   added: (in p5 t0)
   goals met: 0 of 7
3. (load p4 t0 l5)
   deleted: (at p4 l5)
   added: (in p4 t0)
   goals met: 0 of 7
4. (load p1 t0 l5)
   deleted: (at p1 l5)
   added: (in p1 t0)
   goals met: 0 of 7
5. (drive t0 l5 l2 level64 level24 level88)
   deleted: (at t0 l5) (fuel t0 level88)
   added: (at t0 l2) (fuel t0 level64)
   goals met: 0 of 7
6. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 1 of 7
7. (load p3 t0 l2)
   deleted: (at p3 l2)
   added: (in p3 t0)
   goals met: 1 of 7
8. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 1 of 7
9. (drive t0 l2 l3 level48 level16 level64)
   deleted: (at t0 l2) (fuel t0 level64)
   added: (at t0 l3) (fuel t0 level48)
   goals met: 1 of 7
10. (load p6 t0 l3)
   deleted: (at p6 l3)
   added: (in p6 t0)
   goals met: 1 of 7
11. (drive t0 l3 l0 level40 level8 level48)
   deleted: (at t0 l3) (fuel t0 level48)
   added: (at t0 l0) (fuel t0 level40)
   goals met: 1 of 7
12. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 2 of 7
13. (unload p5 t0 l0)
   deleted: (in p5 t0)
   added: (at p5 l0)
   goals met: 3 of 7
14. (drive t0 l0 l1 level38 level2 level40)
   deleted: (at t0 l0) (fuel t0 level40)
   added: (at t0 l1) (fuel t0 level38)
   goals met: 3 of 7
15. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 3 of 7
16. (unload p3 t0 l1)
   deleted: (in p3 t0)
   added: (at p3 l1)
   goals met: 4 of 7
17. (unload p6 t0 l1)
   deleted: (in p6 t0)
   added: (at p6 l1)
   goals met: 5 of 7
18. (drive t0 l1 l4 level31 level7 level38)
   deleted: (at t0 l1) (fuel t0 level38)
   added: (at t0 l4) (fuel t0 level31)
   goals met: 5 of 7
19. (unload p4 t0 l4)
   deleted: (in p4 t0)
   added: (at p4 l4)
   goals met: 6 of 7
20. (drive t0 l4 l5 level25 level6 level31)
   deleted: (at t0 l4) (fuel t0 level31)
   added: (at t0 l5) (fuel t0 level25)
   goals met: 6 of 7
21. (unload p2 t0 l5)
   deleted: (in p2 t0)
   added: (at p2 l5)
   goals met: 7 of 7
